{
  "titles": {
    "name": "Raphael Rocha",
    "title": "Engenheiro de Software Front-end",
    "location": "Belém, Pará, Brasil",
    "contactTitle": "Contato:",
    "skillsTitle": "Principais competências:",
    "languagesTitle": "Idiomas:",
    "experiencesTitle": "Experiências:",
    "educationTitle": "Formação acadêmica:",
    "certificationsTitle": "Certificações:",
    "awardsTitle": "Prêmios e Honras:"
  },
  "contact": {
    "name": "Raphael Rocha",
    "mobile": "+55 (91) 982823076",
    "email": "raphaelrochabcc@gmail.com",
    "linkedin": "www.linkedin.com/in/raphaelrocha-903014103"
  },
  "competences": {
    "languages": ["Português", "Inglês"],
    "programming": [
      "Node.js",
      "React.js",
      "React native",
      "Typescript",
      "HTML",
      "CSS",
      "Firebase",
      "Tailwind CSS",
      "Expo",
      "Redux",
      "MongoDB",
      "MySQL",
      "Express",
      "Styled Components",
      "SASS"
    ],
    "certifications": [
      "McAfee Endpoint Threat Protection/Defense",
      "Bootcamp GoStack 14",
      "Apex One Certified Professional",
      "Deep Security 20 Certified Professional",
      "Deep Discovery Advanced Threat Detection 3.3 Certified Professional"
    ]
  },
  "awards": ["Vencedor do primeiro Hackathon Insern 2021"],
  "summary": "Sou um engenheiro de software front-end com 9 anos de experiência na área de TI, localizado em Belém, Pará, Brasil. Minha especialização em desenvolvimento front-end me permitiu trabalhar com uma ampla gama de projetos, utilizando tecnologias como React, React Native e Node.js. Ao longo da minha carreira, tive a oportunidade de colaborar com empresas renomadas e projetos de impacto, sempre recebendo feedbacks positivos devido à minha dedicação e habilidades técnicas. Como desenvolvedor front-end, minha prioridade é criar interfaces de usuário atraentes e funcionais, garantindo uma experiência do usuário eficiente e intuitiva. Sou fluente em português e inglês e possuo diversas certificações na área de cibersegurança e desenvolvimento. Estou comprometido com a implementação de boas práticas de segurança cibernética e tenho experiência em ambientes de nuvem. Estou constantemente buscando novos desafios e oportunidades de aprendizado para aprimorar minhas habilidades e contribuir ainda mais para o mundo do desenvolvimento front-end.",
  "github": ["https://github.com/RaphaelSR"],

  "experience": [
    {
      "company": "Vix - Grupo Águia Branca",
      "position": "Desenvolvedor Front-end",
      "location": "Remoto",
      "period": "Julho 2022 - Presente",
      "projects": [
        {
          "name": "Vapt-Jornada App",
          "description": "Responsável como desenvolvedor líder do aplicativo Vapt-Jornada, gerenciando e mantendo o aplicativo com mais de 3000 usuários ativos diários nas plataformas Android e iOS, projetando e implementando novos recursos e funcionalidades, identificando e resolvendo bugs e utilizando React Native para o desenvolvimento da nova arquitetura do aplicativo."
        },
        {
          "name": "Vapt-Jornada Aplicativo Web",
          "description": "Manutenção e melhoria dos recursos e funcionalidades do aplicativo web usando React, aderindo às melhores práticas, como Kanban, Scrum, Azure e Git."
        }
      ]
    },
    {
      "company": "Wine.com.br",
      "position": "Desenvolvedor Front-end",
      "location": "Remoto",
      "period": "Outubro 2021 - Junho 2022",
      "projects": [
        {
          "name": "App Wine Brasil",
          "description": "Participação ativa na equipe de desenvolvimento mobile, implementando melhorias e novos recursos que tiveram um impacto direto no produto, usando TDD, padrões de design Kanban, Scrum e versionamento Git com automação e comunicação direta com as equipes de QA e produto."
        },
        {
          "name": "Wine Black Friday",
          "description": "Desenvolvimento da página de comércio eletrônico Wine Black Friday usando React."
        },
        {
          "name": "App Wine México",
          "description": "Participação na equipe de desenvolvimento responsável pela expansão do aplicativo para a América Latina."
        },
        {
          "name": "RestFull API",
          "description": "Manutenção de novos recursos para a API RestFull usando Adonis."
        }
      ]
    },
    {
      "company": "SEPLAD",
      "position": "Desenvolvedor de Software",
      "location": "Remoto",
      "period": "Outubro 2020 - Outubro 2021",
      "projects": [
        {
          "name": "DoarPA",
          "description": "Liderança no desenvolvimento da aplicação web DoarPA, que permite aos usuários doar objetos facilmente para organizações governamentais. Utilizado React para criar uma experiência de usuário perfeita e intuitiva."
        },
        {
          "name": "Sepladpa",
          "description": "Desenvolvimento do aplicativo móvel Sepladpa, que utiliza webviews para fornecer acesso a programas governamentais como LOA e PPA. Utilizado React Native para criar um aplicativo multiplataforma compatível com dispositivos iOS e Android."
        }
      ]
    },
    {
      "company": "Trend Micro",
      "position": "Estudante no CPITS3",
      "location": "Remoto",
      "period": "Fevereiro 2021 - Março 2021",
      "description": "Estagiário no programa de certificação de segurança de TI da Trend Micro. Dois meses com aulas sobre computação em nuvem, segurança em nuvem, hacking ético, LGPD, visão geral sobre cibersegurança, exames e testes semanais e três certificações em cibersegurança.",
      "projects": []
    },
    {
      "company": "Prodepa",
      "position": "Analista de Sistemas",
      "location": "Remoto",
      "period": "Março 2020 - Setembro 2020",
      "description": "Desenvolvedor front-end júnior.",
      "projects": []
    },
    {
      "company": "Casa Civil do Governo do Estado do Pará",
      "position": "Analista de Sistemas",
      "location": "Belém, Pará, Brasil",
      "period": "Março 2019 - Março 2020",
      "description": "Gerenciamento da rede da casa civil do estado do Pará. Aplicação de melhorias nos protocolos internos e estrutura do palácio do governador.",
      "projects": []
    },
    {
      "company": "Lab3D",
      "position": "Gerente de Desenvolvimento de Projetos",
      "location": "Belém, Pará, Brasil",
      "period": "Janeiro 2016 - Julho 2019",
      "description": "CEO e sócio fundador por três anos da startup Lab3D, a primeira startup de treinamento e fabricação de impressoras 3D no norte do Brasil. Última posição como Gerente de desenvolvimento de projetos, trabalhando com fabricação digital, automação em máquinas de prototipagem rápida, liderança, design e inovação.",
      "projects": []
    },
    {
      "company": "Defensoria Pública do Estado do Pará",
      "position": "Estagiário",
      "location": "Belém, Pará, Brasil",
      "period": "Janeiro 2016 - Janeiro 2017",
      "description": "Atuação no setor de redes, função de controle do tráfego de intranet, manutenção do servidor local e planejamento em estratégias futuras."
    },
    {
      "company": "Fábrica de software CESUPA",
      "position": "Estagiário",
      "location": "Belém, Pará, Brasil",
      "period": "Fevereiro 2015 - Dezembro 2015",
      "description": "Atuação na programação de Ruby on Rails, Java e C# para empresas da região Amazônica através de parcerias realizadas pelo CESUPA."
    },
    {
      "company": "CTIC CESUPA",
      "position": "Estagiário",
      "location": "Belém, Pará, Brasil",
      "period": "Agosto 2014 - Janeiro 2015",
      "description": "Estagiário com função de controle de estoque e programação de software interno em Java."
    }
  ],
  "education": {
    "university": "Cesupa - Centro Universitário do Estado do Pará",
    "degree": "Bacharelado, Ciência da Computação",
    "period": "(2014 - 2018)"
  }
}
